Minor modifications
